app/controllers/journal_entries_controller.rb

INSERT INTO "journal_entries" ("title", "body", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "First entry"], ["body", "This is the first entry on postgres"], ["date", "2023-04-07"], ["created_at", "2023-04-08 00:41:48.310507"], ["updated_at", "2023-04-08 00:41:48.310507"]]
---
  def create
    entry = JournalEntry.new(journal_entry_params)
    if entry.save

SELECT "journal_entries".* FROM "journal_entries"
---
  def index
    entries = JournalEntry.all

SELECT "journal_entries".* FROM "journal_entries" WHERE "journal_entries"."date" = ?  [["date", "2022-10-10"]]
---
  def by_date
    entries = JournalEntry.where(date: params[:date])